app/helpers/challenge_users_helper.rb

INSERT INTO "challenge_users" ("challenge_id", "user_id", "fechainicio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["challenge_id", 4], ["user_id", 1], ["fechainicio", "2018-07-23 16:54:14.202555"], ["created_at", "2018-07-23 16:54:14.230557"], ["updated_at", "2018-07-23 16:54:14.230557"]]
---
  def enroll
    @inscripcion = ChallengeUser.new
    @inscripcion.challenge_id = params[:challengeid]
    @inscripcion.user_id = params[:userid]
    @inscripcion.fechainicio = Time.now
    @inscripcion.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "challenge_users".* FROM "challenge_users" WHERE "challenge_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "challenge_users" SET "fechafin" = $1, "updated_at" = $2 WHERE "challenge_users"."id" = $3  [["fechafin", "2018-10-29 17:20:16.696399"], ["updated_at", "2018-10-29 17:20:16.702400"], ["id", 1]]
---
  def finalizar
    @inscripcion = ChallengeUser.find(params[:id])
    @inscripcion.fechafin = Time.now
    @inscripcion.save