app/helpers/course_users_helper.rb

  def enroll(type = 'web')
    @inscripcion = CourseUser.new
    @inscripcion.course_id = params[:courseid]
    @inscripcion.user_id = params[:userid]
    @inscripcion.fechainicio = Time.now
    @inscripcion.save
---
INSERT INTO "course_users" ("course_id", "user_id", "fechainicio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["course_id", 7], ["user_id", 1], ["fechainicio", "2018-07-23 16:33:56.311896"], ["created_at", "2018-07-23 16:33:56.327897"], ["updated_at", "2018-07-23 16:33:56.327897"]]

  def finalizar(type = 'web')
    @inscripcion = CourseUser.find(params[:id])
    @inscripcion.fechafin = Time.now
    @inscripcion.save
---
SELECT  "course_users".* FROM "course_users" WHERE "course_users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "course_users" SET "fechafin" = $1, "updated_at" = $2 WHERE "course_users"."id" = $3  [["fechafin", "2018-07-23 16:39:42.530698"], ["updated_at", "2018-07-23 16:39:42.533698"], ["id", 7]]