app/controllers/api/v1/challenge_users_controller.rb

SELECT "challenge_users".* FROM "challenge_users" WHERE (user_id = 1 AND fechaFin IS NULL) ORDER BY created_at DESC
---
      def index
        @challenge_users = ChallengeUser.all

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show_disp
        @challengesdisp = Challenge.where(["id NOT IN (SELECT challenge_id FROM challenge_users WHERE user_id = ?)", params[:userid]])

SELECT "challenge_users".* FROM "challenge_users" WHERE (user_id = '1' AND fechaFin IS NULL) ORDER BY created_at DESC
---
      def show_act
        @challengeusers = ChallengeUser.where(["user_id = ? AND fechaFin IS NULL", params[:userid]]).order("created_at DESC")

SELECT "challenge_users".* FROM "challenge_users" WHERE (user_id = '1' AND fechaFin IS NOT NULL) ORDER BY created_at DESC
---
      def show_hist
        @challengeusers = ChallengeUser.where(["user_id = ? AND fechaFin IS NOT NULL", params[:userid]]).order("created_at DESC")

SELECT  "challenge_users".* FROM "challenge_users" WHERE "challenge_users"."user_id" = $1 AND "challenge_users"."challenge_id" = $2 ORDER BY "challenge_users"."id" DESC LIMIT $3  [["user_id", 1], ["challenge_id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def set_challenge_user
          @challenge_user = ChallengeUser.find(params[:id])