app/controllers/api/v1/challenge_users_controller.rb

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def show
        @challenge = Challenge.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "8570e7628cdb28a519dbdfa25e68a98e"], ["LIMIT", 1]]
---
        def custom_authenticate_user!
          authenticate_or_request_with_http_token do |token, options|
            @current_user = User.find_by(token: token)