app/controllers/api/v1/complaints_controller.rb

      def complaint_types
        @complaint_types = ComplaintType.all
---
SELECT "complaint_types".* FROM "complaint_types"

        def custom_authenticate_user!
          authenticate_or_request_with_http_token do |token, options|
            @current_user = User.find_by(token: token)
---
SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "8570e7628cdb28a519dbdfa25e68a98e"], ["LIMIT", 1]]