app/controllers/api/v1/complaint_users_controller.rb

      def index
        #@complaint_users = ComplaintUser.all
        @complaint_users = ComplaintUser.where(["user_id = ?", params[:userid]]).order("created_at DESC")
---
SELECT "complaint_users".* FROM "complaint_users" WHERE (user_id = '1') ORDER BY created_at DESC

      def show_hist
        @complaint_users = ComplaintUser.where(["user_id = ?", params[:userid]]).order("created_at DESC")
---
SELECT "complaint_users".* FROM "complaint_users" WHERE (user_id = '1') ORDER BY created_at DESC

      def create
        @complaint_user = ComplaintUser.new(complaint_user_params)

        if @complaint_user.save
---
INSERT INTO "complaint_users" ("complaint_id", "user_id", "direccion", "comentarios", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["complaint_id", 3], ["user_id", 60], ["direccion", "d33"], ["comentarios", "c33"], ["created_at", "2018-09-05 23:01:03.168040"], ["updated_at", "2018-09-05 23:01:03.168040"]]

      def update
        if @complaint_user.update(complaint_user_params)
---
UPDATE "complaint_users" SET "comentarios" = $1, "updated_at" = $2 WHERE "complaint_users"."id" = $3  [["comentarios", "d55xx"], ["updated_at", "2018-09-06 12:05:07.454723"], ["id", 17]]

      def destroy
        @complaint_user.destroy
---
DELETE FROM "complaint_users" WHERE "complaint_users"."id" = $1  [["id", 14]]

        def set_complaint_user
          @complaint_user = ComplaintUser.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
SELECT  "complaint_users".* FROM "complaint_users" WHERE "complaint_users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]