app/controllers/api/v1/complaintfiles_controller.rb

      def index
        #@complaintfiles = Complaintfile.all
        @complaintfilesqueja = Complaintfile.where(["complaint_user_id = ?", params[:idqueja]]).order("created_at ASC")
---
SELECT "complaintfiles".* FROM "complaintfiles" WHERE (complaint_user_id = '17') ORDER BY created_at ASC

      def create
        @complaintfile = Complaintfile.new(complaintfile_params)

        if @complaintfile.save
---
INSERT INTO "complaintfiles" ("complaint_user_id", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["complaint_user_id", 17], ["descripcion", "xxx17_3"], ["created_at", "2018-09-06 22:12:28.060007"], ["updated_at", "2018-09-06 22:12:28.060007"]]

      def update
        if @complaintfile.update(complaintfile_params)
---
UPDATE "complaintfiles" SET "descripcion" = $1, "updated_at" = $2 WHERE "complaintfiles"."id" = $3  [["descripcion", "xxx17_22"], ["updated_at", "2018-09-06 20:43:52.739988"], ["id", 4]]

      def destroy
        @complaintfile.destroy
---
DELETE FROM "complaintfiles" WHERE "complaintfiles"."id" = $1  [["id", 5]]

        def set_complaintfile
          @complaintfile = Complaintfile.find(params[:id])
---
SELECT  "complaintfiles".* FROM "complaintfiles" WHERE "complaintfiles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]