app/controllers/api/v1/course_users_controller.rb

      def show
        @course = Course.find_by(id: params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

        def custom_authenticate_user!
          authenticate_or_request_with_http_token do |token, options|
            @current_user = User.find_by(token: token)
---
SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "8570e7628cdb28a519dbdfa25e68a98e"], ["LIMIT", 1]]