app/controllers/api/v1/users_controller.rb

      def index
        @user = User.order('created_at DESC')
---
SELECT "users".* FROM "users" ORDER BY created_at DESC

      def signup
        # Crea un usuario y devuelve sus datos
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password", "token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

      def signin
        # Si encuentra al usuario devuelve sus datos
        @user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@example.com"], ["LIMIT", 1]]