app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE (email = 'm@m.com') LIMIT $1  [["LIMIT", 11]]
---
      def signin
        @user = User.where(email: params[:email]).first