app/views/complaint_users/_form.html.erb

    <%= form.label "Queja" %>
    <%= form.select :complaint_id, Complaint.all.map{|c| [c.descripcion, c.id]} %>
---
SELECT "complaints".* FROM "complaints"

    <%= form.label "Usuario" %>
    <%= form.select :user_id, User.where(["id = ?", current_user.id]).map{|u| [u.nombre, u.id]} %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]