app/views/challenges/_form.html.erb

    <%= form.label "Nivel Reto" %>
    <%= form.select :challengelevel_id, Challengelevel.all.map{|c| [c.descripcion, c.id]} %>
---
SELECT "challengelevels".* FROM "challengelevels"