app/controllers/challenge_users_controller.rb

  def show_disp
    @challengesdisp = Challenge.where(["id NOT IN (SELECT challenge_id FROM challenge_users WHERE user_id = ?)", current_user.id])
---
SELECT "challenges".* FROM "challenges" WHERE (id NOT IN (SELECT challenge_id FROM challenge_users WHERE user_id = 1))

  def show_act
    @challengeusers = ChallengeUser.where(["user_id = ? AND fechaFin IS NULL", current_user.id]).order("created_at DESC")
---
SELECT "challenge_users".* FROM "challenge_users" WHERE (user_id = 1 AND fechaFin IS NULL) ORDER BY created_at DESC

  def show_hist
    @challengeusers = ChallengeUser.where(["user_id = ? AND fechaFin IS NOT NULL", current_user.id]).order("created_at DESC")
---
SELECT "challenge_users".* FROM "challenge_users" WHERE (user_id = 1 AND fechaFin IS NOT NULL) ORDER BY created_at DESC

    def set_challenge_user
      @challenge_user = ChallengeUser.find(params[:id])
---
SELECT  "challenge_users".* FROM "challenge_users" WHERE "challenge_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]