app/controllers/challengelevels_controller.rb

SELECT "challengelevels".* FROM "challengelevels"
---
  def index
    @challengelevels = Challengelevel.all

INSERT INTO "challengelevels" ("descripcion", "puntos", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["descripcion", "Nivel 01"], ["puntos", 5], ["created_at", "2018-07-23 15:50:15.787010"], ["updated_at", "2018-07-23 15:50:15.787010"]]
---
  def create
    @challengelevel = Challengelevel.new(challengelevel_params)

    respond_to do |format|
      if @challengelevel.save

UPDATE "challengelevels" SET "puntos" = $1, "updated_at" = $2 WHERE "challengelevels"."id" = $3  [["puntos", 16], ["updated_at", "2018-07-23 15:51:04.670806"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @challengelevel.update(challengelevel_params)

DELETE FROM "challengelevels" WHERE "challengelevels"."id" = $1  [["id", 5]]
---
  def destroy
    @challengelevel.destroy

SELECT  "challengelevels".* FROM "challengelevels" WHERE "challengelevels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_challengelevel
      @challengelevel = Challengelevel.find(params[:id])