app/controllers/challenges_controller.rb

  def index
    @challenges = Challenge.all
---
SELECT "challenges".* FROM "challenges"

  def create
    @challenge = Challenge.new(challenge_params)

    respond_to do |format|
      if @challenge.save
---
INSERT INTO "challenges" ("challengelevel_id", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["challengelevel_id", 3], ["descripcion", "Reto 03. Ejecutar ..."], ["created_at", "2018-07-23 15:53:23.697758"], ["updated_at", "2018-07-23 15:53:23.697758"]]

  def update
    respond_to do |format|
      if @challenge.update(challenge_params)
---
UPDATE "challenges" SET "descripcion" = $1, "updated_at" = $2 WHERE "challenges"."id" = $3  [["descripcion", "Reto 03. Salir ..."], ["updated_at", "2018-07-23 16:52:54.938021"], ["id", 3]]

    def set_challenge
      @challenge = Challenge.find(params[:id])
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]