app/controllers/complaints_controller.rb

  def index
    @complaints = Complaint.all
---
SELECT "complaints".* FROM "complaints"

  def create
    @complaint = Complaint.new(complaint_params)

    respond_to do |format|
      if @complaint.save
---
INSERT INTO "complaints" ("descripcion", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descripcion", "Basuras"], ["created_at", "2018-07-23 15:54:02.402972"], ["updated_at", "2018-07-23 15:54:02.402972"]]

    def set_complaint
      @complaint = Complaint.find(params[:id])
---
SELECT  "complaints".* FROM "complaints" WHERE "complaints"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]