app/controllers/complaintfiles_controller.rb

SELECT "complaintfiles".* FROM "complaintfiles" WHERE (complaint_user_id = '1') ORDER BY created_at ASC
---
  def index
    @complaintfiles = Complaintfile.all

INSERT INTO "complaintfiles" ("complaint_user_id", "descripcion", "archivo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["complaint_user_id", 1], ["descripcion", "xxx"], ["archivo", "calle.jpg"], ["created_at", "2018-07-23 17:17:55.255835"], ["updated_at", "2018-07-23 17:17:55.255835"]]
---
  def create
    @complaintfile = Complaintfile.new(complaintfile_params)

    respond_to do |format|
      if @complaintfile.save

SELECT  "complaintfiles".* FROM "complaintfiles" WHERE "complaintfiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_complaintfile
      @complaintfile = Complaintfile.find(params[:id])