app/controllers/complaint_users_controller.rb

  def index
    #@complaint_users = ComplaintUser.all
    @complaint_users = ComplaintUser.where(["user_id = ?", current_user.id]).order("created_at DESC")
---
SELECT "complaint_users".* FROM "complaint_users" WHERE (user_id = 1) ORDER BY created_at DESC

  def create
    @complaint_user = ComplaintUser.new(complaint_user_params)

    respond_to do |format|
      if @complaint_user.save
---
INSERT INTO "complaint_users" ("complaint_id", "user_id", "direccion", "comentarios", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["complaint_id", 1], ["user_id", 2], ["direccion", "bbb"], ["comentarios", "Coment02b"], ["created_at", "2018-09-02 17:34:31.245788"], ["updated_at", "2018-09-02 17:34:31.245788"]]

    def set_complaint_user
      @complaint_user = ComplaintUser.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "complaint_users".* FROM "complaint_users" WHERE "complaint_users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]