app/controllers/course_users_controller.rb

SELECT "courses".* FROM "courses" WHERE (id NOT IN (SELECT course_id FROM course_users WHERE user_id = 1))
---
  def show_disp
    @coursesdisp = Course.where(["id NOT IN (SELECT course_id FROM course_users WHERE user_id = ?)", current_user.id])

SELECT "course_users".* FROM "course_users" WHERE (user_id = 1 AND fechaFin IS NULL) ORDER BY created_at DESC
---
  def show_act
    @courseusers = CourseUser.where(["user_id = ? AND fechaFin IS NULL", current_user.id]).order("created_at DESC")

SELECT "course_users".* FROM "course_users" WHERE (user_id = 1 AND fechaFin IS NOT NULL) ORDER BY created_at DESC
---
  def show_hist
    @courseusers = CourseUser.where(["user_id = ? AND fechaFin IS NOT NULL", current_user.id]).order("created_at DESC")

SELECT  "course_users".* FROM "course_users" WHERE "course_users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_course_user
      @course_user = CourseUser.find(params[:id])