app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("nombre", "contenido", "puntos", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "Curso 01"], ["contenido", "Contenido curso 01"], ["puntos", 10], ["created_at", "2018-07-23 15:21:35.287603"], ["updated_at", "2018-07-23 15:21:35.287603"]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "contenido" = $1, "puntos" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["contenido", "Contenido curso 02"], ["puntos", 20], ["updated_at", "2018-07-23 15:21:53.135624"], ["id", 2]]

  def destroy
    @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 11]]

    def set_course
      @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]