app/controllers/home_controller.rb

SELECT "courses".* FROM "courses" WHERE (id NOT IN (SELECT course_id FROM course_users WHERE user_id = 1))
SELECT "challenges".* FROM "challenges" WHERE (id NOT IN (SELECT challenge_id FROM challenge_users WHERE user_id = 1))
SELECT "complaints".* FROM "complaints" WHERE "complaints"."user_id" = $1  [["user_id", 1]]
---
  def dashboard
    @courses_available = Course.where(["id NOT IN (SELECT course_id FROM course_users WHERE user_id = ?)", current_user.id])
    @complaints = current_user.complaints
    @challenges_available = Challenge.where(["id NOT IN (SELECT challenge_id FROM challenge_users WHERE user_id = ?)", current_user.id])