app/models/user.rb

    def generate_token
      loop do
        token = SecureRandom.hex
        return token unless User.exists?({token: token})
---
SELECT  1 AS one FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "99ee0b26abd1a0606464c8905634c455"], ["LIMIT", 1]]